FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC43xx/LPC43xx_USBDeviceController.c
/*-------------------------------------------------------------------------*
 * File:  LPC43xx_USBDev.c
 *-------------------------------------------------------------------------*
 * Description:
 *      HAL implementation of the LPC43xx USBDev (Ethernet) Driver.
 * Implementation:
 *
 *-------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------
 * uEZ(R) - Copyright (C) 2007-2015 Future Designs, Inc.
 *--------------------------------------------------------------------------
 * This file is part of the uEZ(R) distribution.  See the included
 * uEZLicense.txt or visit http://www.teamfdi.com/uez for details.
 *
 *    *===============================================================*
 *    |  Future Designs, Inc. can port uEZ(R) to your own hardware!  |
 *    |             We can get you up and running fast!               |
*    |      See http://goo.gl/UDtTCR for more details.               |
 *    *===============================================================*
 *
 *-------------------------------------------------------------------------*/
#include <Config.h>
#include <uEZTypes.h>
#include <uEZProcessor.h>
#include <HAL/Interrupt.h>
// TBD:  not here!
#include <uEZRTOS.h>
#include <Source/Processor/NXP/LPC43xx/LPC43xx_USBDeviceController.h>
#include <uEZGPIO.h>

/*-------------------------------------------------------------------------*
 * USB Registers:
 *-------------------------------------------------------------------------*/

#define dprintf(...)

    // USB Device Interrupts Bits:
        // every 1 ms interrupt (for isochronous packet transfers)
        #define USB_DEV_FRAME                       (1<<0)

        // Fast interrupt transfer
        #define EP_FAST                     (1<<1)

        // Slow interrupt tranfer
        #define EP_SLOW                     (1<<2)

        // Device status changed
        #define DEV_STAT                    (1<<3)

        // Command code register is empty (new commands can be written)
        #define CCEMTY                      (1<<4)

        // Command data register is full (data can be read now)
        #define CDFULL                      (1<<5)

        // Current packet in FIFO has been transferred to the CPU
        #define RxENDPKT                    (1<<6)

        // The number of data bytes transferred to the FIFO equals
        // the number of bytes programmed in the TxPacket length register
        #define TxENDPKT                    (1<<7)

        // Endpoints realized.
        #define EP_RLZED                    (1<<8)

        // Error interrupt.
        #define ERR_INT                     (1<<9)


/*-------------------------------------------------------------------------*
 * Constants:
 *-------------------------------------------------------------------------*/
// Device commands:
#define USB_DEVICE_CMD_SET_ADDRESS                      0xD0
#define USB_DEVICE_SET_ADDRESS_ADDRESS		            (1<<0) // 6 bits
#define USB_DEVICE_SET_ADDRESS_ENABLE		            (1<<7)
#define USB_DEVICE_CMD_CONFIG                           0xD8
#define USB_DEVICE_CONFIG                               (1<<0)
#define USB_DEVICE_CMD_SET_MODE                         0xF3
#define USB_DEVICE_CMD_READ_CUR_FRAME_NR                0xF5
#define USB_DEVICE_CMD_READ_TEST_REG                    0xFD
#define USB_DEVICE_CMD_STATUS                           0xFE
#define USB_DEVICE_CMD_GET_ERROR_CODE                   0xFF
#define USB_DEVICE_CMD_READ_ERROR_STATUS                0xFB

// Endpoint commands:
#define USB_ENDPOINT_CMD_SELECT                         0x00
#define USB_ENDPOINT_CMD_SELECT_CLEAR                   0x40
#define USB_ENDPOINT_CMD_SET_STATUS                     0x40
#define ENDPOINT_STATUS_STALLED                         (1<<0)
#define ENDPOINT_STATUS_DISABLED                        (1<<5)
#define ENDPOINT_STATUS_RATE_FEEDBACK_MODE              (1<<6)
#define ENDPOINT_STATUS_CONDITIONAL_STALL               (1<<7)
#define USB_ENDPOINT_CMD_CLEAR_BUFFER                   0xF2
#define USB_ENDPOINT_CMD_VALIDATE_BUFFER                0xFA

// Bits: USB->USBCtrl
#define RD_EN                   (1<<0)
#define WR_EN                   (1<<1)
#define LOG_ENDPOINT            (1<<2)

// Bits: USB->USBRxPLen
#define PKT_LNGTH               (1<<0) // 10 bits
#define PKT_LNGTH_MASK          ((1<<10)-1)
#define DV                      (1<<10)
#define PKT_RDY                 (1<<11)


/*---------------------------------------------------------------------------*
 * Types:
 *---------------------------------------------------------------------------*/
typedef struct {
    const HAL_USBDeviceController *iHAL;
    T_USBDeviceControllerSettings iSettings;
    TUInt8 iConfigurationNumber;

} T_LPC43xx_USBDev_Workspace;

/*---------------------------------------------------------------------------*
 * Globals:
 *---------------------------------------------------------------------------*/
extern const HAL_USBDeviceController LPC43xx_USBDev_Interface;
T_LPC43xx_USBDev_Workspace *G_LPC43xx_USBDev_Workspace=0;

/*---------------------------------------------------------------------------*
 * Prototypes:
 *---------------------------------------------------------------------------*/
static void LPC43xx_USBDev_EndpointConfigure(
        void *aWorkspace,
        TUInt8 aEndpoint,
        TUInt16 aMaxPacketSize);

/*-------------------------------------------------------------------------*
 * Internal Function:  IEndpointToIndex
 *-------------------------------------------------------------------------*
 * Description:
 *      Convert a standard endpoint identifier to a LPC21xx USB endpoint
 *      index number.
 * Inputs:
 *      TUInt8 aEndpoint         -- Endpoint number
 * Outputs:
 *      TUInt32 aIndex           -- USB Hardware endpoint number
 *-------------------------------------------------------------------------*/
static INLINE TUInt32 IEndpointToIndex(TUInt8 aEndpoint)
{
    TUInt32 index = aEndpoint & 0x0F;
    index <<= 1;
    index |= ((aEndpoint & 0x80)>>7);
    return index;
}

