FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC43xx/LPC43xx_USBDeviceController.c
/*-------------------------------------------------------------------------*
 * Internal Function:  IIndexToEndpoint
 *-------------------------------------------------------------------------*
 * Description:
 *      Convert a LPC21xx USB endpoint index number to a standard
 *      endpoint identifier.
 * Inputs:
 *      TUInt32 aIndex           -- USB Hardware endpoint number
 * Outputs:
 *      TUInt8 aEndpoint         -- Endpoint number
 *-------------------------------------------------------------------------*/
static INLINE TUInt8 IIndexToEndpoint(TUInt32 aIndex)
{
    TUInt8 endpointNum = (TUInt8) (aIndex>>1);
    endpointNum |= (aIndex & 1) << 7;
    return endpointNum;
}

/*-------------------------------------------------------------------------*
 * Internal Function:  IWaitForDeviceInterrupt
 *-------------------------------------------------------------------------*
 * Description:
 *      Wait for any of the given device interrupt flags to go from 1 to 0.
 * Inputs:
 *      T_LPC43xx_USBDev_Workspace *p -- workspace
 *      TUInt32 aDevInterruptFlags -- Flag(s) to wait to go from 0 to 1
 *-------------------------------------------------------------------------*/
static void IWaitForDeviceInterrupt(
                T_LPC43xx_USBDev_Workspace *p,
                TUInt32 aDevInterruptFlags)
{
    PARAM_NOT_USED(p);
    while ((LPC_USB->USBDevIntSt & aDevInterruptFlags) != aDevInterruptFlags)
        {}
    LPC_USB->USBDevIntClr = aDevInterruptFlags;
}

/*-------------------------------------------------------------------------*
 * Internal Function:  ILPC43xx_USBDev_Command
 *-------------------------------------------------------------------------*
 * Description:
 *      Put a command in the command buffer after clearing the command
 *      related device interrupt flags.
 * Inputs:
 *      T_LPC43xx_USBDev_Workspace *p -- workspace
 *      TUInt8 aCommand           -- Command to send
 *-------------------------------------------------------------------------*/
static void ILPC43xx_USBDev_Command(
            T_LPC43xx_USBDev_Workspace *p,
            TUInt8 aCommand)
{
if (aCommand == USB_ENDPOINT_CMD_VALIDATE_BUFFER)
    dprintf("[Cmd V]");
else if (aCommand == USB_ENDPOINT_CMD_CLEAR_BUFFER)
    dprintf("[Cmd C]");
else if (aCommand <= 0x3F)
    dprintf("[Cmd S%d]", aCommand&0x3F);
else if ((aCommand & 0xC0)==0x40)
    dprintf("[Cmd SC%d]", aCommand&0x3F);
else if (aCommand == USB_DEVICE_CMD_SET_MODE)
    dprintf("[Cmd SM]");
else if (aCommand == USB_DEVICE_CMD_STATUS)
    ; // do nothing
else
    dprintf("[Cmd ?%02X]", aCommand);
    // Start by clearing the full and empty flags for the
    // command.
    LPC_USB->USBDevIntClr = CDFULL | CCEMTY;

    // Write a command in the form of:
    //    0x00CC0500
    //    where CC = 8-bit command
    LPC_USB->USBCmdCode = 0x00000500 | (aCommand << 16);

    // Wait for there to be room for another command
    IWaitForDeviceInterrupt(p, CCEMTY);
}

/*-------------------------------------------------------------------------*
 * Internal Function:  ILPC43xx_USBDev_CommandAndWrite
 *-------------------------------------------------------------------------*
 * Description:
 *      Write a command and then write the data after it.
 * Inputs:
 *      T_LPC43xx_USBDev_Workspace *p -- workspace
 *      TUInt8 aCommand           -- Command to send
 *      TUInt16 aData             -- Data to go after command
 *-------------------------------------------------------------------------*/
static void ILPC43xx_USBDev_CommandAndWrite(
                T_LPC43xx_USBDev_Workspace *p,
                TUInt8 aCommand,
                TUInt16 aData)
{
    // First, write the command
    ILPC43xx_USBDev_Command(p, aCommand);

    // Then, write the data
    LPC_USB->USBCmdCode = 0x00000100 | (aData << 16);

    // Wait for room to be made available for more data
    IWaitForDeviceInterrupt(p, CCEMTY);
}

/*-------------------------------------------------------------------------*
 * Internal Function:  ILPC43xx_USBDev_CommandAndRead
 *-------------------------------------------------------------------------*
 * Description:
 *      Write a command and then read the data after it.
 * Inputs:
 *      T_LPC43xx_USBDev_Workspace *p -- workspace
 *      TUInt8 aCommand           -- Command to send
 * Outputs:
 *      TUInt8                    -- Data received
 *-------------------------------------------------------------------------*/
static TUInt8 ILPC43xx_USBDev_CommandAndRead(
                T_LPC43xx_USBDev_Workspace *p,
                TUInt8 aCommand)
{
    // First, write a command
    ILPC43xx_USBDev_Command(p, aCommand);

    // Second, read back a byte
    LPC_USB->USBCmdCode = 0x00000200 | (aCommand << 16);

    // Wait until data is ready to be read
    IWaitForDeviceInterrupt(p, CDFULL);

    return (TUInt8)LPC_USB->USBCmdData;
}

/*-------------------------------------------------------------------------*
 * Function:  LPC43xx_USBDev_InterruptNakEnable
 *-------------------------------------------------------------------------*
 * Description:
 *      Declares which NAK bits to produce interrupts on.
 * Inputs:
 *      T_LPC43xx_USBDev_Workspace *p -- workspace
 *      TUInt8 aNakBits             -- Or'd list of NAK bits to interrupt on
 *-------------------------------------------------------------------------*/
static void LPC43xx_USBDev_InterruptNakEnable(
            void *aWorkspace,
            TUInt8 aNakBits)
{
    T_LPC43xx_USBDev_Workspace *p = (T_LPC43xx_USBDev_Workspace *)aWorkspace;

    ILPC43xx_USBDev_CommandAndWrite(p, USB_DEVICE_CMD_SET_MODE, aNakBits);
}

/*-------------------------------------------------------------------------*
 * Function:  LPC43xx_USBDev_EndpointInterruptsEnable
 *-------------------------------------------------------------------------*
 * Description:
 *      Allow an endpoint to generate interrupts.
 * Inputs:
 *      T_LPC43xx_USBDev_Workspace *p -- workspace
 *      TUInt8 aEndpoint            -- Endpoint to trigger interrupts
 *-------------------------------------------------------------------------*/
static void LPC43xx_USBDev_EndpointInterruptsEnable(
                void *aWorkspace,
                TUInt8 aEndpoint)
{
    TUInt32 aIndex = IEndpointToIndex(aEndpoint);

    // Enable interrupts for this endpoint
    // using regular "slow" method
    LPC_USB->USBEpIntEn |= (1 << aIndex);
    LPC_USB->USBDevIntEn |= EP_SLOW;
}

