FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC43xx/LPC43xx_USBDeviceController.c
    // Index currently is 0 or non-zero.  If 0, it means
    // we are closing out the configuration.  Is it a zero?
    if (aConfigurationIndex == 0)  {
        // Yes, then kill the configuration
        LPC43xx_USBDev_DeviceIsNotConfigured(aWorkspace);
    } else {
        // Otherwise, we are going to use the existing configuration
        while (p_header->iLength)  {
            if (p_header->iDescriptorType == USB_DESCRIPTOR_CONFIGURATION)  {
                // Found a configuration, the following
                // descriptors are now in that configuration
//                configuration =
//                    ((T_USBDescriptorConfiguration *)p)->iConfigurationValue;
            } else if (p_header->iDescriptorType == USB_DESCRIPTOR_ENDPOINT)  {
                // Only configure this endpoint if we have a matching
                // configuration number and alternate setting number.
                #define p_endpoint ((T_USBDescriptorEndpoint *)p)
                LPC43xx_USBDev_EndpointConfigure(
                    aWorkspace,
                    p_endpoint->iAddress,
                    p_endpoint->iMaximumPacketSize);
            }
            // Next descriptor
            p += p_header->iLength;
            p_header = (T_USBDescriptorHeader *)p;
        }
        // Got to the end
        // Report that this device is configured.
        LPC43xx_USBDev_DeviceIsConfigured((void *)p_workspace);
    }

    // Remember our configuration number
    p_workspace->iConfigurationNumber = aConfigurationIndex;
}

/*-------------------------------------------------------------------------*
 * Function:  LPC43xx_USBDev_GetConfiguration
 *-------------------------------------------------------------------------*
 * Description:
 *      Go through the descriptor table and enable all endpoints for
 *      the given descriptor index and alternative setting.
 *      All corresponding endpoints are configured for matches.
 * Inputs:
 *      void *aWorkspace          -- USBDev Controller's workspace
 * Outputs:
 *      TUInt8 aConfigurationIndex-- Descriptor index of config in use.
 *-------------------------------------------------------------------------*/
static TUInt8 LPC43xx_USBDev_GetConfiguration(
                void *aWorkspace)
{
    T_LPC43xx_USBDev_Workspace *p_workspace =
            (T_LPC43xx_USBDev_Workspace *)aWorkspace;

    // Report our configuration
    return p_workspace->iConfigurationNumber;
}

/*-------------------------------------------------------------------------*
 * Function:  LPC43xx_USBDev_ForceAddressAndConfiguration
 *-------------------------------------------------------------------------*
 * Description:
 *      Force the USB to go to a given address and configuration.
 * Inputs:
 *      void *aWorkspace          -- USBDev Controller's workspace
 *      TUInt8 aAddress           -- Address of connection
 *      TUInt8 aConfigNum         -- Number of configuration to use
 *-------------------------------------------------------------------------*/
void LPC43xx_USBDev_ForceAddressAndConfiguration(
            void *aWorkspace,
            TUInt8 aAddress,
            TUInt8 aConfigNum)
{
    T_LPC43xx_USBDev_Workspace *p = (T_LPC43xx_USBDev_Workspace *)aWorkspace;

    LPC43xx_USBDev_SetAddress(aWorkspace, aAddress);
    LPC43xx_USBDev_SetConfiguration(aWorkspace, aConfigNum);
    p->iConfigurationNumber = aConfigNum;
}

/*-------------------------------------------------------------------------*
 * Internal Function:  IEndpointEnable
 *-------------------------------------------------------------------------*
 * Description:
 *      Enable endpoint.
 * Inputs:
 *      T_LPC43xx_USBDev_Workspace *p -- workspace
 *      TUInt32 aIndex            -- Index of endpoint
 *-------------------------------------------------------------------------*/
static void LPC43xx_USBDev_EndpointEnable(
                T_LPC43xx_USBDev_Workspace *p,
                int aIndex)
{
    ILPC43xx_USBDev_CommandAndWrite(
        p,
        USB_ENDPOINT_CMD_SET_STATUS | aIndex,
        0);
}

/*-------------------------------------------------------------------------*
 * Internal Function:  LPC43xx_USBDev_EndpointDisable
 *-------------------------------------------------------------------------*
 * Description:
 *      Disable endpoint.
 * Inputs:
 *      T_LPC43xx_USBDev_Workspace *p -- workspace
 *      TUInt32 aIndex            -- Index of endpoint
 *-------------------------------------------------------------------------*/
#if 0
static void LPC43xx_USBDev_EndpointDisable(
                T_LPC43xx_USBDev_Workspace *p,
                int aIndex)
{
    ILPC43xx_USBDev_CommandAndWrite(
            p,
            USB_ENDPOINT_CMD_SET_STATUS | aIndex,
            ENDPOINT_STATUS_DISABLED);
}
#endif

/*-------------------------------------------------------------------------*
 * Internal Function:  LPC43xx_USBDev_EndpointRealize
 *-------------------------------------------------------------------------*
 * Description:
 *      Realize an endpoint by telling the hardware to reserve space and
 *      to set the maximum packet size.
 * Inputs:
 *      T_LPC43xx_USBDev_Workspace *p -- workspace
 *      TUInt32 aIndex            -- Index of endpoint
 *      TUInt16 aMaxPacketSize    -- Maximum size of packet (in bytes)
 *-------------------------------------------------------------------------*/
static void LPC43xx_USBDev_EndpointRealize(
                T_LPC43xx_USBDev_Workspace *p,
                TUInt32 aIndex,
                TUInt16 aMaxPacketSize)
{
    // Declare which endpoint is going to be realized
    // using a bit position.
    LPC_USB->USBReEp |= (1 << aIndex);
    LPC_USB->USBEpInd = aIndex;

    // Declare size of maximum packets
    LPC_USB->USBMaxPSize = aMaxPacketSize;

    // Wait for endpoint to be fully realized
    IWaitForDeviceInterrupt(p, EP_RLZED);
}

/*-------------------------------------------------------------------------*
 * Function:  LPC43xx_USBDev_EndpointConfigure
 *-------------------------------------------------------------------------*
 * Description:
 *      Realize and enable an endpoint.
 * Inputs:
 *      void *aWorkspace          -- USBDev Controller's workspace
 *      TUInt8 aEndpoint            -- Endpoint identifier
 *      TUInt16 aMaxPacketSize      -- Maximum size of packets
 *-------------------------------------------------------------------------*/
static void LPC43xx_USBDev_EndpointConfigure(
            void *aWorkspace,
            TUInt8 aEndpoint,
            TUInt16 aMaxPacketSize)
{
    TUInt32 aIndex = IEndpointToIndex(aEndpoint);
    T_LPC43xx_USBDev_Workspace *p = (T_LPC43xx_USBDev_Workspace *)aWorkspace;

    // realise EP
    LPC43xx_USBDev_EndpointRealize(p, aIndex, aMaxPacketSize);

